---
kind: method
id: M:Autodesk.Revit.DB.FillPattern.SetFillGrids(System.Collections.Generic.IList{Autodesk.Revit.DB.FillGrid})
source: html/843826d6-9ba4-90e2-1ca7-e1db865a2935.htm
---
# Autodesk.Revit.DB.FillPattern.SetFillGrids Method

Set the fill grids in this fill pattern.

## Syntax (C#)
```csharp
public void SetFillGrids(
	IList<FillGrid> fillGrids
)
```

## Parameters
- **fillGrids** (`System.Collections.Generic.IList < FillGrid >`) - The fill grids to be used.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null